# IndependentTag Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
IndependentTag Class
Members See Also
---
Represents tag annotations in Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public class IndependentTag : Element
```

Visual Basic
---
```text
Public Class IndependentTag _
	Inherits Element
```

Visual C++
---
```text
public ref class IndependentTag : public Element
```

# Remarks
IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags. IndependentTag is also the base class for other annotations like keynote tags and span symbols. Room, area and space tags are not derived from IndependentTag. [!:Autodesk::Revit::DB::SpatialElementTag] for more information.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..IndependentTag Autodesk.Revit.DB.Structure..::..FabricReinSpanSymbol Autodesk.Revit.DB.Structure..::..PathReinSpanSymbol Autodesk.Revit.DB.Structure..::..RebarSystemSpanSymbol
# See Also
IndependentTag Members
Autodesk.Revit.DB Namespace